{
    "Name": "Pilot Quirks",
    "Enabled": true,

    "Version": "2.0",
    "Description": "Adds pilot abilities based upon what tags they have.",
    "Author": "don Zappo",
    "Website": "",
	
	"DLL": "Pilot_Quirks.dll",
	
	"DependsOn": [ "Monthly Tech Adjustment" , "PanicSystem" , "Pilot Fatigue" ],
	
	"Settings": {
        "IsSaveGame": false,
		"pilot_tech_TechBonus" : 100,
		"pilot_tech_vanillaTech" : false,
		"pilot_tech_TechsNeeded" : 3,
		"pilot_reckless_ToHitBonus" : -1,
		"pilot_reckless_ToBeHitBonus" : -1,
		"pilot_cautious_ToHitBonus" : 1,
        "pilot_cautious_ToBeHitBonus" : 1,
        "pilot_assassin_CalledShotBonus" : 0.25,
        "pilot_merchant_ShopDiscount" : 1,
        "pilot_lucky_InjuryAvoidance" : 10,
        "pilot_disgraced_MoralePenalty" : -1,
        "pilot_jinxed_ToHitBonus" : 1,
        "pilot_jinxed_ToBeHitBonus" : -1,
        
        "pilot_drunk_ToHitBonus" : 1,
        "pilot_lostech_ToHitBonus" : -1,
        "pilot_naive_LessExperience" : 0.1,
        "pilot_noble_IncreasedCost" : 0.5,
        "pilot_criminal_StealPercent" : 5,
        "pilot_criminal_StealAmount" : -1000,
        "pilot_spacer_DecreasedCost" : -0.5,
        "pilot_comstar_TechBonus" : 200,
        "pilot_comstar_StoreBonus" : 3,
        "pilot_honest_MoraleBonus" : 1,
        "pilot_dishonest_MoralePenalty" : -1,
		
		
		"TagIdToDescription" : {
			"pilot_assassin" : "This pilot was formerly a killer-for-hire.\n\nBonus to Called Shots.",
			"pilot_athletic" : "This pilot enjoys physical exercise and competition.\n\nLess Fatigue generated from combat.",
			"pilot_bookish" : "This pilot would rather be reading a book than anything else.\n\nIncreased Tactics but decreased Piloting, Gunnery, and Guts." ,
			"pilot_brave" : "This pilot is known for their bravery in the face of danger.\n\nIncrease to Panic resistance.",
			"pilot_cautious" : "This pilot is known to be careful and cautious.\n\nPilot is harder to hit, but suffers to-hit penalties.",
			"pilot_command" : "This pilot has experience commanding a lance, a ship, or other military unit.\n\nGains XP more quickly and has a higher XP cap.",
			"pilot_comstar" : "This pilot was formerly a ComStar adept.\n\nIncreased MechTech Skill.",
			"pilot_criminal" : "This pilot's checkered past has left them familiar with the criminal underworld.\n\nChance to steal c-bills every day.",
			"pilot_dependable" : "This pilot is known to be reliable.\n\nDecreased chance of ejecting due to panic.",
			"pilot_disgraced" : "This pilot resigned in disgrace from a former position of power and prestige.\n\nDecreased company morale while this pilot is around.",
			"pilot_dishonest" : "A cloud of mistrust hangs over this pilot.\n\nDecrease in company morale and causes different types of mischief every month." ,
			"pilot_drunk" : "This pilot has trouble with alcohol or other intoxicants.\n\nWhen Fatigued: +1 to-hit, -1 evasion pips, 100% chance to avoid ejection.",
			"pilot_gladiator" : "This pilot was once one of the famed MechWarrior gladiators of the arenas of Solaris VII.\n\nLess resolve lost when fatigued and does not get Low Spirits from fatigue.",
			"pilot_honest" : "This pilot is trustworthy and honest.\n\nIncreased company morale and prevents criminals from stealing.",
			"pilot_jinxed" : "Everything goes wrong for this pilot.\n\nHarder for this pilot to hit while also being easier to be hit by the enemy.",
			"pilot_klutz" : "This pilot is known for dropping expensive and fragile items, tripping over their own feet, and walking into bulkheads.\n\nReduced stability and small chance to eject when knocked down.",
			"pilot_lostech" : "This pilot is experienced in researching and maintaining the mysterious technology of the Star League.\n\nIncreased chance to hit when using LosTech weapons.",
			"pilot_lucky" : "This pilot has uncanny luck.\n\nReduced chance to suffer wounds in combat.",
			"pilot_mechwarrior" : "This pilot is a veteran MechWarrior, with actual combat experience.\n\nModerate bonus to starting XP.",
			"pilot_merchant" : "This pilot's former mercantile career gave them experience with the trade routes and business practices of the Inner Sphere.\n\nDiscount to buying items at shops.",
			"pilot_military" : "This pilot is a veteran of one of the military forces of the Inner Sphere.\n\nSmall bonus to starting XP.",
			"pilot_naive" : "This pilot is overly trusting and innocent about the harsh realities of the world.\n\nReduced XP gained from combat.",
			"pilot_noble" : "This pilot was born to a noble family of the Inner Sphere or the Periphery.\n\nIncreased maintenance costs. Mood changes based upon funding.",
			"pilot_officer" : "This pilot was an officer in one of the military forces of the Inner Sphere.\n\nIncreased gain in XP. Large increase in XP Cap.",
			"pilot_rebellious" : "This pilot makes their own way in the world, and doesn't like authority or rules.\n\n Reduced Resolve when in combat with an Officer or the Company Commander.",
			"pilot_reckless" : "This pilot takes unacceptable and even dangerous risks.\n\nIncreased chance to hit in combat while being easier to be hit by the enemy.",
			"pilot_spacer" : "This pilot is comfortable with low gravity life aboard a space ship or station.\n\nPilot costs less maintenance every month.",
			"pilot_tech" : "This pilot is skilled with the repair and maintenance of technology.\n\nIncreased MechTech Skill.",
			"pilot_unstable" : "This pilot's mental state is unpredictable and explosive\n\nPilot's mood changes every day.",
			"pilot_wealthy" : "This pilot is well-off, whether through inheritance or the rewards of hard work.\n\nNo monthly maintenance costs."
		}
	}
}